Clomann/stm32h7-CAN-sniffer/platform/drivers/fdcan/fdcan.c
/*
 * fdcan.c
 *
 *  Created on: 14.09.2024
 *      Author: Clemens
 */

#include "fdcan.h"
#include "CommTypes.h"
#include "fdcan_utils.h"
#include "nvic_irg_config.h"
#include "stm32h7xx_hal_fdcan.h"
#include "stm32h7xx_hal_rcc_ex.h"
#include <stdbool.h>
#include <stdint.h>
#include <string.h>

#define FDCAN_1_NBR COMM_DEVICE_NUMBER_1
#define FDCAN_2_NBR COMM_DEVICE_NUMBER_2

typedef struct
{
    FDCAN_GlobalTypeDef *fdcan;
    FDCAN_HandleTypeDef hfdcan;
    FDCAN_RxHeaderTypeDef rxheader;
    uint64_t mostRecentInterrupTimestamp;
#if CAN_STATIC_TX_REPLAY_ENABLE
    uint32_t staticReplayBufferMask;
    uint32_t staticReplayPendingBatchMask;
    uint32_t staticReplayRequests;
    uint32_t staticReplayCompleted;
    uint32_t staticReplayIrqs;
    uint8_t staticReplayPrepared;
    uint8_t staticReplayActive;
#endif
} FdcanInstanceType;

static FdcanInstanceType fdcan_hfdcan[FDCAN_MAX_INSTANCES] = {
    {.fdcan = NULL, .mostRecentInterrupTimestamp = 0},
    {.fdcan = NULL, .mostRecentInterrupTimestamp = 0}
};

CommDriverConfigType Can1Cfg;

/* Private function prototypes -----------------------------------------------*/
comm_status_t FDCAN_Ioctl(CommDriver *handle, int cmd, void *argument);

comm_status_t fdcan_find_free(FdcanInstanceType **handle)
{
    comm_status_t res = COMM_ERROR;

    for (uint8_t i = 0; i < FDCAN_MAX_INSTANCES; i++)
    {
        if (NULL == fdcan_hfdcan[i].fdcan)
        {
            *handle = &fdcan_hfdcan[i];
            res     = COMM_SUCCESS;
            break;
        }
    }

    return res;
}

comm_status_t fdcan_get_can(CommDriver *dev, FDCAN_HandleTypeDef **fdcan)
{
    FdcanInstanceType *instance;

    if (NULL == dev || NULL == dev->instance)
    {
        return COMM_NULL_POINTER;
    }

    instance = (FdcanInstanceType *)dev->instance;

    *fdcan = &instance->hfdcan;

    return COMM_SUCCESS;
}

comm_status_t
fdcan_get_handle(FDCAN_GlobalTypeDef *fdcan, FdcanInstanceType **handle)
{
    if (NULL == fdcan)
    {
        return COMM_ERROR;
    }

    for (uint8_t i = 0; i < FDCAN_MAX_INSTANCES; i++)
    {
        if (fdcan == fdcan_hfdcan[i].fdcan)
        {
            *handle = &fdcan_hfdcan[i];
            return COMM_SUCCESS;
        }
    }

    return COMM_ERROR;
}

comm_status_t get_fdcan_config(FdcanInstanceType *, FDCAN_FilterTypeDef *);

comm_status_t
fdcan_init_tx_header(const void *, FDCAN_TxHeaderTypeDef *, uint32_t);

#if CAN_STATIC_TX_REPLAY_ENABLE
static uint32_t fdcan_static_replay_buffer_mask(uint32_t buffer_count)
{
    if (buffer_count >= 32U)
    {
        return 0xFFFFFFFFU;
    }

    return (1UL << buffer_count) - 1UL;
}

static uint32_t fdcan_static_replay_batch_complete_mask(uint32_t buffer_count)
{
    if (0U == buffer_count)
    {
        return 0U;
    }

    return 1UL << (buffer_count - 1U);
}

static uint32_t fdcan_static_replay_base_id(FDCAN_GlobalTypeDef *fdcan)
{
    if (FDCAN_2 == fdcan)
    {
        return CAN_STATIC_TX_REPLAY_CAN2_BASE_ID;
    }

    return CAN_STATIC_TX_REPLAY_CAN1_BASE_ID;
}

static uint32_t fdcan_static_replay_channel_bit(FDCAN_GlobalTypeDef *fdcan)
{
    if (FDCAN_2 == fdcan)
    {
        return 0x2U;
    }

    return 0x1U;
}

static bool fdcan_static_replay_channel_enabled(FDCAN_GlobalTypeDef *fdcan)
{
    return (
        (CAN_STATIC_TX_REPLAY_CHANNEL_MASK
         & fdcan_static_replay_channel_bit(fdcan))
        != 0U
    );
}

static comm_status_t fdcan_static_replay_prepare_instance(
    FdcanInstanceType *instance,
    uint32_t base_id,
    uint32_t id_count
)
{
    FDCAN_TxHeaderTypeDef tx_header;
    uint8_t tx_data[8] = {0U};
    uint32_t buffer_count;
    uint32_t id_range;

    if (NULL == instance)
    {
        return COMM_NULL_POINTER;
    }

    buffer_count = CAN_STATIC_TX_REPLAY_TX_BUFFERS;
    if (buffer_count == 0U)
    {
        return COMM_INVALID_PARAMETER;
    }

    id_range = (id_count == 0U) ? 1U : id_count;
    if (id_range > 0x800U)
    {
        return COMM_INVALID_PARAMETER;
    }

    instance->staticReplayPrepared         = 0U;
    instance->staticReplayActive           = 0U;
    instance->staticReplayPendingBatchMask = 0U;
    instance->staticReplayBufferMask =
        fdcan_static_replay_buffer_mask(buffer_count);

    memset(&tx_header, 0, sizeof(tx_header));
    tx_header.IdType              = FDCAN_STANDARD_ID;
    tx_header.TxFrameType         = FDCAN_DATA_FRAME;
    tx_header.DataLength          = FDCAN_DLC_BYTES_0;
    tx_header.ErrorStateIndicator = FDCAN_ESI_ACTIVE;
    tx_header.BitRateSwitch       = FDCAN_BRS_OFF;
    tx_header.FDFormat            = FDCAN_CLASSIC_CAN;
    tx_header.TxEventFifoControl  = FDCAN_NO_TX_EVENTS;

    for (uint32_t i = 0U; i < buffer_count; i++)
    {
        tx_header.Identifier    = (base_id + (i % id_range)) & 0x7FFU;
        tx_header.MessageMarker = i & 0xFFU;

        if (HAL_OK
            != HAL_FDCAN_AddMessageToTxBuffer(
                &instance->hfdcan,
                &tx_header,
                tx_data,
                (1UL << i)
            ))
        {
            return COMM_ERROR;
        }
    }

    instance->staticReplayPrepared = 1U;

    return COMM_SUCCESS;
}

static comm_status_t
fdcan_static_replay_prepare_default(FdcanInstanceType *instance)
{
    if (!fdcan_static_replay_channel_enabled(instance->fdcan))
    {
        instance->staticReplayBufferMask       = 0U;
        instance->staticReplayPendingBatchMask = 0U;
        instance->staticReplayPrepared         = 1U;
        instance->staticReplayActive           = 0U;
        return COMM_SUCCESS;
    }

    return fdcan_static_replay_prepare_instance(
        instance,
        fdcan_static_replay_base_id(instance->fdcan),
        CAN_STATIC_TX_REPLAY_ID_COUNT
    );
}

static void
fdcan_static_replay_rearm(FdcanInstanceType *instance, uint32_t mask)
{
    uint32_t request_mask;

    if ((NULL == instance) || (0U == instance->staticReplayActive)
        || (0U == instance->staticReplayPrepared))
    {
        return;
    }

    request_mask = mask & instance->staticReplayBufferMask;
    if (0U == request_mask)
    {
        return;
    }

    instance->hfdcan.Instance->TXBAR = request_mask;
    instance->staticReplayRequests += __builtin_popcount(request_mask);
}
#endif

comm_status_t FDCAN_GetMostRecentTimestamp(CommDriver *dev, uint64_t *timestamp)
{
    comm_status_t res = 0;
    FdcanInstanceType *instance;

