Clomann/stm32h7-CAN-sniffer/platform/drivers/fdcan/fdcan.c
    if (NULL == dev || NULL == dev->instance || NULL == timestamp)
    {
        res = COMM_NULL_POINTER;
        return res;
    }

    instance = (FdcanInstanceType *)dev->instance;

    if (COMM_SUCCESS != res)
    {
        FDCAN_ErrorHandler();
        return res;
    }

    *timestamp = instance->mostRecentInterrupTimestamp;
    return res;
}

uint64_t SampleTime(void);

comm_status_t FDCAN_CreateDriver(
    CommDriver *pDriver,
    const void *cfg,
    size_t cfg_size,
    uint8_t *tx,
    uint8_t *rx
)
{
    comm_status_t RetVal;
    FdcanInstanceType *instance;

    RetVal          = COMM_ERROR;
    pDriver->config = (CommDriverConfigType *)cfg;

    if (sizeof(CommDriverConfigType) != cfg_size)
    {
        FDCAN_ErrorHandler();
    }

    if (COMM_SUCCESS != fdcan_find_free(&instance))
    {
        RetVal = COMM_ERROR;
        FDCAN_ErrorHandler();
    }

    switch (pDriver->config->devNbr)
    {
    case COMM_DEVICE_NUMBER_1:
        instance->fdcan = FDCAN_1;
        RetVal          = COMM_SUCCESS;
        break;
    case COMM_DEVICE_NUMBER_2:
        instance->fdcan = FDCAN_2;
        RetVal          = COMM_SUCCESS;
        break;
    default:
        RetVal = COMM_ERROR;
        break;
    }

    if (COMM_SUCCESS != RetVal)
    {
        FDCAN_ErrorHandler();
    }

    pDriver->instance = (void *)instance;

    pDriver->interface->init  = FDCAN_Init;
    pDriver->interface->send  = FDCAN_Send;
    pDriver->interface->read  = FDCAN_Read;
    pDriver->interface->ioctl = FDCAN_Ioctl;
    pDriver->state            = DRIVER_STATE_UNINITIALIZED;
    pDriver->protocol         = DRIVER_FDCAN;
    pDriver->TxFrameBuffer    = tx;
    pDriver->RxFrameBuffer    = rx;

    pDriver->state = DRIVER_STATE_INITIALIZED;
    RetVal         = COMM_SUCCESS;

    return RetVal;
}

COMM_REGISTER_DRIVER(DRIVER_FDCAN, FDCAN_CreateDriver);

comm_status_t FDCAN_Init(CommDriver *dev)
{
    FDCAN_FilterTypeDef sFilterConfig;
    comm_status_t RetVal;
    FdcanInstanceType *instance;

    RetVal   = COMM_SUCCESS;
    instance = (FdcanInstanceType *)dev->instance;

    // TODO make init function consistent with driver creation
    get_fdcan_config(instance, &sFilterConfig);

#if FDCCAN_USE_TIMESTAMP_COUNTER
    HAL_FDCAN_EnableTimestampCounter(
        &instance->hfdcan,
        FDCAN_TIMESTAMP_EXTERNAL
    );
#else
    HAL_FDCAN_EnableTimestampCounter(
        &instance->hfdcan,
        FDCAN_TIMESTAMP_INTERNAL
    );
#endif

    if (HAL_FDCAN_Init(&instance->hfdcan) != HAL_OK)
    {
        /* Initialization Error */
        RetVal = COMM_ERROR;
    }

#if CAN_STATIC_TX_REPLAY_ENABLE
    if (COMM_SUCCESS == RetVal
        && COMM_SUCCESS != fdcan_static_replay_prepare_default(instance))
    {
        RetVal = COMM_ERROR;
    }
#endif

    if (0 != instance->hfdcan.ErrorCode)
    {
        FDCAN_ErrorHandler();
    }

    if (HAL_FDCAN_ConfigTimestampCounter(
            &instance->hfdcan,
            FDCAN_TIMESTAMP_PRESC_1
        )
        != HAL_OK)
    {
        /* Initialization Error */
        RetVal = COMM_ERROR;
    }

    if (0 != instance->hfdcan.ErrorCode)
    {
        FDCAN_ErrorHandler();
    }

    if (HAL_FDCAN_EnableTimestampCounter(
            &instance->hfdcan,
            FDCAN_TIMESTAMP_EXTERNAL
        )
        != HAL_OK)
    {
        /* Initialization Error */
        RetVal = COMM_ERROR;
    }

    if (0 != instance->hfdcan.ErrorCode)
    {
        FDCAN_ErrorHandler();
    }

    /* Configure Rx filter */
    if (HAL_FDCAN_ConfigFilter(&instance->hfdcan, &sFilterConfig) != HAL_OK)
    {
        /* Filter configuration Error */
        RetVal = COMM_ERROR;
    }

    if (0 != instance->hfdcan.ErrorCode)
    {
        FDCAN_ErrorHandler();
    }

#if ((FDCAN_IRQ_NOTIFICATION & FDCAN_IT_RX_FIFO0_WATERMARK) != 0U)
#if FDCAN_IRQ_RX_WATERMARK < 2
#error "Implausible value for FDCAN_IRQ_RX_WATERMARK!"
#endif
    HAL_FDCAN_ConfigFifoWatermark(
        &instance->hfdcan,
        FDCAN_CFG_RX_FIFO0,
        FDCAN_IRQ_RX_WATERMARK
    );

    if (0 != instance->hfdcan.ErrorCode)
    {
        FDCAN_ErrorHandler();
    }
#endif

    if (HAL_FDCAN_ActivateNotification(
            &instance->hfdcan,
            FDCAN_IRQ_NOTIFICATION,
            0
        )
        != HAL_OK)
    {
        /* Notification Error */
        RetVal = COMM_ERROR;
    }

    if (0 != instance->hfdcan.ErrorCode)
    {
        FDCAN_ErrorHandler();
    }

    /* Prepare Tx Header */

    if (0 == RetVal)
    {
        dev->state = DRIVER_STATE_INITIALIZED;
    }
    return RetVal;
}

comm_status_t FDCAN_DeInit(CommDriver *dev)
{
    comm_status_t RetVal;
    FdcanInstanceType *instance;

    RetVal   = COMM_SUCCESS;
    instance = (FdcanInstanceType *)dev->instance;

    if (HAL_FDCAN_DeactivateNotification(
            &instance->hfdcan,
            FDCAN_IRQ_NOTIFICATION
        )
        != HAL_OK)
    {
        /* Notification Error */
        RetVal = COMM_ERROR;
    }

    /* Stop the FDCAN module */
    if (HAL_FDCAN_Stop(&instance->hfdcan) != HAL_OK)
    {
        /* Start Error */
        RetVal = COMM_ERROR;
    }

    if (HAL_FDCAN_DisableTimestampCounter(&instance->hfdcan) != HAL_OK)
    {
        /* Initialization Error */
        RetVal = COMM_ERROR;
    }

    if (HAL_FDCAN_DeInit(&instance->hfdcan) != HAL_OK)
    {
        /* Initialization Error */
        RetVal = COMM_ERROR;
    }

    return RetVal;
}

comm_status_t FDCAN_Send(CommDriver *dev, const void *pMsg)
{
#if CAN_STATIC_TX_REPLAY_ENABLE
    (void)dev;
    (void)pMsg;
    return COMM_INVALID_STATE;
#else
    comm_status_t RetVal;
    uint8_t *pData;
    FDCAN_Message *pMsgCpy;
    FDCAN_TxHeaderTypeDef TxHeader;
    FdcanInstanceType *instance;

    if (DRIVER_STATE_STARTED != dev->state)
    {
        return COMM_INVALID_STATE;
    }

    RetVal   = COMM_SUCCESS;
    instance = (FdcanInstanceType *)dev->instance;
    pMsgCpy  = (FDCAN_Message *)pMsg;
    pData    = (uint8_t *)(pMsgCpy->msgBase.payload);

    (void)fdcan_init_tx_header(pMsgCpy, &TxHeader, pMsgCpy->msgBase.length);

    if (HAL_FDCAN_STATE_BUSY != HAL_FDCAN_GetState(&instance->hfdcan))
    {
        RetVal = COMM_ERROR;
    }
    else if (HAL_FDCAN_AddMessageToTxFifoQ(&instance->hfdcan, &TxHeader, pData)
             == HAL_OK)
    {
        RetVal = COMM_SUCCESS;
    }
    else
    {
        RetVal = COMM_ERROR;
    }

    return RetVal;
#endif
}

comm_status_t
FDCAN_Read(CommDriver *dev, void *pFrame, uint8_t length, uint32_t RxFifo0ITs)
{
    comm_status_t RetVal;
    uint8_t Data[64];
    FDCAN_ClassicFrameType *pNewFrame;
    FdcanInstanceType *instance;
    FDCAN_RxHeaderTypeDef rxheader;
    uint8_t PayloadLen = 0;
    uint32_t Brs;
    uint32_t Esi;
    uint32_t Ide;
    uint32_t FdFormat;

