Clomann/stm32h7-CAN-sniffer/platform/drivers/fdcan/fdcan.c
    RetVal    = COMM_SUCCESS;
    instance  = (FdcanInstanceType *)dev->instance;
    pNewFrame = (FDCAN_ClassicFrameType *)pFrame;

    if ((RxFifo0ITs & FDCAN_IRQ_NOTIFICATION) != RESET)
    {
        memset(&rxheader, 0, sizeof(rxheader));

        /* Retreive Rx messages from RX FIFO0 */
        if (HAL_FDCAN_GetRxMessage(
                &instance->hfdcan,
                FDCAN_RX_FIFO0,
                &rxheader,
                Data
            )
            != HAL_OK)
        {
            /* Reception Error */
            RetVal = COMM_ERROR;
        }

        if (RetVal != COMM_SUCCESS)
        {
            return RetVal;
        }

        pNewFrame->dlc_dl_flags = 0U;

        Brs = (rxheader.BitRateSwitch & FDCAN_BRS_ON) ? 1U : 0U;
        FDCAN_SET_BRS(pNewFrame, Brs);

        Esi = (rxheader.ErrorStateIndicator & FDCAN_ESI_PASSIVE) ? 1U : 0U;
        FDCAN_SET_ESI(pNewFrame, Esi);

        Ide = (rxheader.IdType & FDCAN_EXTENDED_ID) ? 1U : 0U;
        FDCAN_SET_IDE(pNewFrame, Ide);

        FdFormat = (rxheader.FDFormat & FDCAN_FD_CAN) ? 1U : 0U;
        FDCAN_SET_FDF(pNewFrame, FdFormat);

        switch (rxheader.DataLength)
        {
        case FDCAN_DLC_BYTES_0:
            FDCAN_SET_DLC(pNewFrame, 0);
            FDCAN_SET_DATA_LEN(pNewFrame, 0);
            break;
        case FDCAN_DLC_BYTES_1:
            FDCAN_SET_DLC(pNewFrame, 1);
            FDCAN_SET_DATA_LEN(pNewFrame, 1);
            break;
        case FDCAN_DLC_BYTES_2:
            FDCAN_SET_DLC(pNewFrame, 2);
            FDCAN_SET_DATA_LEN(pNewFrame, 2);
            break;
        case FDCAN_DLC_BYTES_3:
            FDCAN_SET_DLC(pNewFrame, 3);
            FDCAN_SET_DATA_LEN(pNewFrame, 3);
            break;
        case FDCAN_DLC_BYTES_4:
            FDCAN_SET_DLC(pNewFrame, 4);
            FDCAN_SET_DATA_LEN(pNewFrame, 4);
            break;
        case FDCAN_DLC_BYTES_5:
            FDCAN_SET_DLC(pNewFrame, 5);
            FDCAN_SET_DATA_LEN(pNewFrame, 5);
            break;
        case FDCAN_DLC_BYTES_6:
            FDCAN_SET_DLC(pNewFrame, 6);
            FDCAN_SET_DATA_LEN(pNewFrame, 6);
            break;
        case FDCAN_DLC_BYTES_7:
            FDCAN_SET_DLC(pNewFrame, 7);
            FDCAN_SET_DATA_LEN(pNewFrame, 7);
            break;
        case FDCAN_DLC_BYTES_8:
            FDCAN_SET_DLC(pNewFrame, 8);
            FDCAN_SET_DATA_LEN(pNewFrame, 8);
            break;
        case FDCAN_DLC_BYTES_12:
            FDCAN_SET_DLC(pNewFrame, 9);
            FDCAN_SET_DATA_LEN(pNewFrame, 12);
            break;
        case FDCAN_DLC_BYTES_16:
            FDCAN_SET_DLC(pNewFrame, 10);
            FDCAN_SET_DATA_LEN(pNewFrame, 16);
            break;
        case FDCAN_DLC_BYTES_20:
            FDCAN_SET_DLC(pNewFrame, 11);
            FDCAN_SET_DATA_LEN(pNewFrame, 20);
            break;
        case FDCAN_DLC_BYTES_24:
            FDCAN_SET_DLC(pNewFrame, 12);
            FDCAN_SET_DATA_LEN(pNewFrame, 24);
            break;
        case FDCAN_DLC_BYTES_32:
            FDCAN_SET_DLC(pNewFrame, 13);
            FDCAN_SET_DATA_LEN(pNewFrame, 32);
            break;
        case FDCAN_DLC_BYTES_48:
            FDCAN_SET_DLC(pNewFrame, 14);
            FDCAN_SET_DATA_LEN(pNewFrame, 48);
            break;
        case FDCAN_DLC_BYTES_64:
            FDCAN_SET_DLC(pNewFrame, 15);
            FDCAN_SET_DATA_LEN(pNewFrame, 64);
            break;
        default:
            FDCAN_SET_DLC(pNewFrame, 0);
            FDCAN_SET_DATA_LEN(pNewFrame, 0);
        };

        pNewFrame->id        = rxheader.Identifier;
        pNewFrame->timestamp = rxheader.RxTimestamp;

        PayloadLen = FDCAN_GET_DATA_LEN(pNewFrame);
        if (PayloadLen > sizeof(Data))
        {
            PayloadLen = sizeof(Data);
        }
        memcpy(pNewFrame->data, &Data[0], PayloadLen);

        if (HAL_FDCAN_ActivateNotification(
                &instance->hfdcan,
                FDCAN_IRQ_NOTIFICATION,
                0
            )
            != HAL_OK)
        {
            /* Notification Error */
            RetVal = COMM_ERROR;
        }
    }

    return RetVal;
}

comm_status_t FDCAN_RegisterTxMessage(Message *pMsg)
{
    return COMM_ERROR;
}

comm_status_t FDCAN_RegisterRxMessage(Message *pMsg)
{
    return COMM_ERROR;
}

uint64_t FDCAN_GetMostRecentInterruptTimestamp(CommDriver *dev)
{
    return ((FdcanInstanceType *)dev->instance)->mostRecentInterrupTimestamp;
}

#if CAN_STATIC_TX_REPLAY_ENABLE
comm_status_t FDCAN_StaticTxReplayPrepare(
    CommDriver *dev,
    uint32_t base_id,
    uint32_t id_count
)
{
    FdcanInstanceType *instance;

    if ((NULL == dev) || (NULL == dev->instance))
    {
        return COMM_NULL_POINTER;
    }

    instance = (FdcanInstanceType *)dev->instance;
    if (!fdcan_static_replay_channel_enabled(instance->hfdcan.Instance))
    {
        instance->staticReplayBufferMask       = 0U;
        instance->staticReplayPendingBatchMask = 0U;
        instance->staticReplayPrepared         = 1U;
        instance->staticReplayActive           = 0U;
        return COMM_SUCCESS;
    }

    return fdcan_static_replay_prepare_instance(instance, base_id, id_count);
}

comm_status_t FDCAN_StaticTxReplayStart(CommDriver *dev)
{
    FdcanInstanceType *instance;

    if ((NULL == dev) || (NULL == dev->instance))
    {
        return COMM_NULL_POINTER;
    }

    instance = (FdcanInstanceType *)dev->instance;
    if (!fdcan_static_replay_channel_enabled(instance->hfdcan.Instance))
    {
        instance->staticReplayActive = 0U;
        return COMM_SUCCESS;
    }

    if (0U == instance->staticReplayPrepared)
    {
        return COMM_INVALID_STATE;
    }

    instance->staticReplayActive = 1U;
    instance->staticReplayPendingBatchMask =
        fdcan_static_replay_batch_complete_mask(CAN_STATIC_TX_REPLAY_TX_BUFFERS
        );
    fdcan_static_replay_rearm(instance, instance->staticReplayBufferMask);

    return COMM_SUCCESS;
}

comm_status_t FDCAN_StaticTxReplayStop(CommDriver *dev)
{
    FdcanInstanceType *instance;

