Clomann/stm32h7-CAN-sniffer/platform/drivers/fdcan/fdcan.c
    if ((NULL == dev) || (NULL == dev->instance))
    {
        return COMM_NULL_POINTER;
    }

    instance                               = (FdcanInstanceType *)dev->instance;
    instance->staticReplayActive           = 0U;
    instance->staticReplayPendingBatchMask = 0U;

    if (!fdcan_static_replay_channel_enabled(instance->hfdcan.Instance))
    {
        return COMM_SUCCESS;
    }

    if (HAL_OK
        != HAL_FDCAN_DeactivateNotification(
            &instance->hfdcan,
            FDCAN_IT_TX_COMPLETE
        ))
    {
        return COMM_ERROR;
    }

    __HAL_FDCAN_CLEAR_IT(&instance->hfdcan, FDCAN_IT_TX_COMPLETE);

    return COMM_SUCCESS;
}

comm_status_t FDCAN_StaticTxReplayGetStats(
    CommDriver *dev,
    FdcanStaticTxReplayStatsType *stats
)
{
    FdcanInstanceType *instance;

    if ((NULL == dev) || (NULL == dev->instance) || (NULL == stats))
    {
        return COMM_NULL_POINTER;
    }

    instance         = (FdcanInstanceType *)dev->instance;
    stats->requests  = instance->staticReplayRequests;
    stats->completed = instance->staticReplayCompleted;
    stats->irqs      = instance->staticReplayIrqs;

    return COMM_SUCCESS;
}

void FDCAN_StaticTxReplayIrqHandler(FDCAN_GlobalTypeDef *fdcan)
{
    FdcanInstanceType *instance;
    uint32_t completed;

    if (COMM_SUCCESS != fdcan_get_handle(fdcan, &instance))
    {
        FDCAN_ErrorHandler();
        return;
    }

    if (!fdcan_static_replay_channel_enabled(instance->hfdcan.Instance))
    {
        return;
    }

    completed = instance->hfdcan.Instance->TXBTO;
    completed &= instance->staticReplayPendingBatchMask;

    __HAL_FDCAN_CLEAR_FLAG(&instance->hfdcan, FDCAN_FLAG_TX_COMPLETE);

    if (0U != completed)
    {
        instance->staticReplayIrqs++;
        instance->staticReplayCompleted +=
            __builtin_popcount(instance->staticReplayBufferMask);
        instance->staticReplayPendingBatchMask =
            fdcan_static_replay_batch_complete_mask(
                CAN_STATIC_TX_REPLAY_TX_BUFFERS
            );
        fdcan_static_replay_rearm(instance, instance->staticReplayBufferMask);
    }
}
#endif

void FDCAN_1_IRQHandler(void)
{
    FdcanInstanceType *instance;

    if (COMM_SUCCESS != fdcan_get_handle(FDCAN1, &instance))
    {
        FDCAN_ErrorHandler();
    }

    /* capture timestamp at the moment of the interrupt */
    instance->mostRecentInterrupTimestamp = SampleTime();
    HAL_FDCAN_IRQHandler(&instance->hfdcan);
}

void FDCAN_2_IRQHandler(void)
{
    FdcanInstanceType *instance;

    if (COMM_SUCCESS != fdcan_get_handle(FDCAN2, &instance))
    {
        FDCAN_ErrorHandler();
    }

    instance->mostRecentInterrupTimestamp = SampleTime();
    HAL_FDCAN_IRQHandler(&instance->hfdcan);
}

#if CAN_STATIC_TX_REPLAY_ENABLE
void FDCAN_1_TX_IRQHandler(void)
{
    FDCAN_StaticTxReplayIrqHandler(FDCAN_1);
}

void FDCAN_2_TX_IRQHandler(void)
{
    FDCAN_StaticTxReplayIrqHandler(FDCAN_2);
}
#endif

/* IOCTL/ driver specific functions */

static comm_status_t FDCAN_SetBaudrate(CommDriver *dev, uint32_t baudrate)
{
    comm_status_t res   = 0;
    uint32_t FdcanClock = 0;
    uint8_t timings[4];
    bool IsDataPhase = false;
    uint16_t Prescaler;
    uint8_t Seg1;
    uint8_t Seg2;
    uint8_t Sjw;
    FdcanInstanceType *instance;

    instance   = (FdcanInstanceType *)dev->instance;
    FdcanClock = HAL_RCCEx_GetPeriphCLKFreq(RCC_PERIPHCLK_FDCAN);

    res = COMM_SUCCESS;
    switch (baudrate)
    {
    case FDCAN_BAUDRATE_250000:
    case FDCAN_BAUDRATE_500000:
    case FDCAN_BAUDRATE_1000000:
        break;
    default:
        res = COMM_INVALID_PARAMETER;
        break;
    }

    memset(timings, 0x00, sizeof(timings));

    if (COMM_SUCCESS != res)
    {
    }
    else if (0
             == CANFD_CalculateBitTimingRegister(
                 FdcanClock,
                 baudrate,
                 7500,
                 1,
                 IsDataPhase,
                 timings
             ))
    {
        res = COMM_SUCCESS;
    }
    else
    {
        res = COMM_ERROR;
    }

    if (COMM_SUCCESS == res)
    {
        Prescaler = CANFD_GetPrescaler(timings, IsDataPhase);
        Seg1      = CANFD_GetSeg1(timings, IsDataPhase);
        Seg2      = CANFD_GetSeg2(timings, IsDataPhase);
        Sjw       = CANFD_GetSJW(timings, IsDataPhase);

        instance->hfdcan.Init.NominalPrescaler     = Prescaler;
        instance->hfdcan.Init.NominalSyncJumpWidth = Sjw;
        instance->hfdcan.Init.NominalTimeSeg1      = Seg1;
        instance->hfdcan.Init.NominalTimeSeg2      = Seg2;

        if (HAL_FDCAN_Init(&instance->hfdcan) != HAL_OK)
        {
            /* Initialization Error */
            res = COMM_ERROR;
        }

#if CAN_STATIC_TX_REPLAY_ENABLE
        if (COMM_SUCCESS == res
            && COMM_SUCCESS != fdcan_static_replay_prepare_default(instance))
        {
            res = COMM_ERROR;
        }
#endif
    }

    return res;
}

static comm_status_t FDCAN_SetMode(CommDriver *dev, uint32_t mode)
{
    comm_status_t res = 0;
    FdcanInstanceType *instance;

    instance = (FdcanInstanceType *)dev->instance;

    switch (mode)
    {
    case FDCAN_MODE_1:
#if CAN_STATIC_TX_REPLAY_ENABLE
        instance->hfdcan.Init.Mode = CAN_STATIC_TX_REPLAY_FDCAN_MODE;
#else
        instance->hfdcan.Init.Mode = FDCAN_MODE_NORMAL;
#endif
        res = COMM_SUCCESS;
        break;
    case FDCAN_MODE_2:
        instance->hfdcan.Init.Mode = FDCAN_MODE_BUS_MONITORING;
        res                        = COMM_SUCCESS;
        break;
    case FDCAN_MODE_4:
        instance->hfdcan.Init.Mode = FDCAN_MODE_EXTERNAL_LOOPBACK;
        res                        = COMM_SUCCESS;
        break;
    default:
        res = COMM_INVALID_PARAMETER;
        break;
    }

    if (COMM_SUCCESS == res)
    {
        if (HAL_FDCAN_Init(&instance->hfdcan) != HAL_OK)
        {
            /* Initialization Error */
            res = COMM_ERROR;
        }

#if CAN_STATIC_TX_REPLAY_ENABLE
        if (COMM_SUCCESS == res
            && COMM_SUCCESS != fdcan_static_replay_prepare_default(instance))
        {
            res = COMM_ERROR;
        }
#endif
    }

    return res;
}

comm_status_t FDCAN_Ioctl(CommDriver *dev, int cmd, void *argument)
{
    int HalRes        = 0;
    comm_status_t res = 0;
    FdcanInstanceType *instance;

