Clomann/stm32h7-CAN-sniffer/platform/drivers/fdcan/fdcan.c
    instance = (FdcanInstanceType *)dev->instance;

    switch (cmd)
    {
    case CANABS_IOCTL_CMD_SET_BAUDRATE: {
        FdcanBaudrateType baudrate = *((FdcanBaudrateType *)argument);
        res                        = FDCAN_SetBaudrate(dev, baudrate);
    }
    break;
    case CANABS_IOCTL_CMD_START:
        if (DRIVER_STATE_STARTED == dev->state)
        {
            /* nothing to do */
        }
        else if (HAL_OK != HAL_FDCAN_Start(&instance->hfdcan))
        {
            /* Start Error */
            res = COMM_ERROR;
            FDCAN_ErrorHandler();
        }
#if CAN_STATIC_TX_REPLAY_ENABLE
        else if (!fdcan_static_replay_channel_enabled(instance->hfdcan.Instance
                 ))
        {
            if (HAL_OK
                != HAL_FDCAN_ActivateNotification(
                    &instance->hfdcan,
                    FDCAN_IRQ_NOTIFICATION,
                    0
                ))
            {
                res = COMM_ERROR;
                FDCAN_ErrorHandler();
            }
        }
        else if (0U == instance->staticReplayPrepared)
        {
            res = COMM_INVALID_STATE;
            FDCAN_ErrorHandler();
        }
        else if (HAL_OK
                 != HAL_FDCAN_ConfigInterruptLines(
                     &instance->hfdcan,
                     FDCAN_IT_TX_COMPLETE,
                     FDCAN_INTERRUPT_LINE1
                 ))
        {
            res = COMM_ERROR;
            FDCAN_ErrorHandler();
        }
        else if (HAL_OK
                 != HAL_FDCAN_ActivateNotification(
                     &instance->hfdcan,
                     FDCAN_IRQ_NOTIFICATION | FDCAN_IT_TX_COMPLETE,
                     fdcan_static_replay_batch_complete_mask(
                         CAN_STATIC_TX_REPLAY_TX_BUFFERS
                     )
                 ))
        {
            res = COMM_ERROR;
            FDCAN_ErrorHandler();
        }
        else
        {
            instance->staticReplayActive = 1U;
            instance->staticReplayPendingBatchMask =
                fdcan_static_replay_batch_complete_mask(
                    CAN_STATIC_TX_REPLAY_TX_BUFFERS
                );
            fdcan_static_replay_rearm(
                instance,
                instance->staticReplayBufferMask
            );
        }
#else
        else if (HAL_OK
                 == HAL_FDCAN_AbortTxRequest(
                     &instance->hfdcan,
                     FDCAN_TX_BUFFER0 | FDCAN_TX_BUFFER1 | FDCAN_TX_BUFFER2
                 ))
        {
            HAL_FDCAN_ActivateNotification(
                &instance->hfdcan,
                FDCAN_IRQ_NOTIFICATION,
                0
            );
        }
#endif

        if (COMM_SUCCESS == res)
        {
            dev->state = DRIVER_STATE_STARTED;
        }
        else
        {
            res = COMM_ERROR;
        }
        break;
    case CANABS_IOCTL_CMD_STOP:
        if (DRIVER_STATE_STARTED != dev->state)
        {
            /* nothing to do */
        }
#if CAN_STATIC_TX_REPLAY_ENABLE
        else if (COMM_SUCCESS != FDCAN_StaticTxReplayStop(dev))
        {
            res = COMM_ERROR;
            FDCAN_ErrorHandler();
        }
#endif
        else if ((HAL_FDCAN_DeactivateNotification(
                      &instance->hfdcan,
                      FDCAN_IRQ_NOTIFICATION
                  )
                  != HAL_OK))
        {
            /* Start Error */
            res = COMM_ERROR;
            FDCAN_ErrorHandler();
        }
        else if (HAL_FDCAN_Stop(&instance->hfdcan) != HAL_OK)
        {
            /* Start Error */
            res = COMM_ERROR;
            FDCAN_ErrorHandler();
        }
        else if ((HalRes = HAL_FDCAN_AbortTxRequest(
                      &instance->hfdcan,
#if CAN_STATIC_TX_REPLAY_ENABLE
                      instance->staticReplayBufferMask
#else
                      FDCAN_TX_BUFFER0 | FDCAN_TX_BUFFER1 | FDCAN_TX_BUFFER2
#endif
                  ))
                 != HAL_OK)
        {
            /* Start Error */
            res = COMM_ERROR;
            (void)(HalRes);
            FDCAN_ErrorHandler();
        }
        else
        {
            __HAL_FDCAN_CLEAR_IT(&instance->hfdcan, FDCAN_IRQ_NOTIFICATION);
        }

        if (COMM_SUCCESS == res
            || (instance->hfdcan.ErrorCode & HAL_FDCAN_ERROR_NOT_STARTED))
        {
            dev->state = DRIVER_STATE_STOPPED;
        }
        break;
    case CANABS_IOCTL_CMD_SET_MODE: {
        FdcanModeType mode = *((FdcanModeType *)argument);
        res                = FDCAN_SetMode(dev, mode);

        if (COMM_SUCCESS == res && mode == FDCAN_MODE_3)
        {
            dev->state = DRIVER_STATE_OFF;
        }
    }
    break;
        break;
    case CANABS_IOCTL_CMD_SET_FILTERMASK:
    default:
        res = 1;
        break;
    }

    return res;
}

static inline void gpio_clk_enable(GPIO_TypeDef *port)
{
    if (port == GPIOA)
    {
        __HAL_RCC_GPIOA_CLK_ENABLE();
    }
    else if (port == GPIOB)
    {
        __HAL_RCC_GPIOB_CLK_ENABLE();
    }
    else if (port == GPIOC)
    {
        __HAL_RCC_GPIOC_CLK_ENABLE();
    }
    else if (port == GPIOD)
    {
        __HAL_RCC_GPIOD_CLK_ENABLE();
    }
    else if (port == GPIOE)
    {
        __HAL_RCC_GPIOE_CLK_ENABLE();
    }
#ifdef GPIOF
    else if (port == GPIOF)
    {
        __HAL_RCC_GPIOF_CLK_ENABLE();
    }
#endif
#ifdef GPIOG
    else if (port == GPIOG)
    {
        __HAL_RCC_GPIOG_CLK_ENABLE();
    }
#endif
#ifdef GPIOH
    else if (port == GPIOH)
    {
        __HAL_RCC_GPIOH_CLK_ENABLE();
    }
#endif
}

HAL_StatusTypeDef FDCAN_GpioClck(FDCAN_GlobalTypeDef *fdcan)
{
    HAL_StatusTypeDef res;

    res = HAL_OK;

    if (FDCAN_1 == fdcan)
    {
        CLK_ENABLE(FDCAN_1_TX_GPIO_PORT);
        CLK_ENABLE(FDCAN_1_RX_GPIO_PORT);
    }
    else if (FDCAN_2 == fdcan)
    {
        CLK_ENABLE(FDCAN_2_TX_GPIO_PORT);
        CLK_ENABLE(FDCAN_2_RX_GPIO_PORT);
    }
    else
    {
        res = HAL_ERROR;
    }

    return res;
}

