Clomann/stm32h7-CAN-sniffer/platform/drivers/fdcan/fdcan.c
HAL_StatusTypeDef FDCAN_InitGpio(FDCAN_GlobalTypeDef *fdcan)
{
    HAL_StatusTypeDef res;

    res = HAL_OK;

    GPIO_InitTypeDef GPIO_InitStruct;

    GPIO_InitStruct.Mode  = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull  = GPIO_PULLUP;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;

    if (FDCAN_1 == fdcan)
    {
        GPIO_InitStruct.Pin       = FDCAN_1_TX_PIN;
        GPIO_InitStruct.Alternate = FDCAN_1_TX_AF;
        (void)HAL_GPIO_Init(FDCAN_1_TX_GPIO_PORT, &GPIO_InitStruct);

        /* FDCANx RX GPIO pin configuration  */
        GPIO_InitStruct.Pin       = FDCAN_1_RX_PIN;
        GPIO_InitStruct.Alternate = FDCAN_1_RX_AF;
        (void)HAL_GPIO_Init(FDCAN_1_RX_GPIO_PORT, &GPIO_InitStruct);
    }
    else if (FDCAN_2 == fdcan)
    {
        GPIO_InitStruct.Pin       = FDCAN_2_TX_PIN;
        GPIO_InitStruct.Alternate = FDCAN_2_TX_AF;
        (void)HAL_GPIO_Init(FDCAN_2_TX_GPIO_PORT, &GPIO_InitStruct);

        /* FDCANx RX GPIO pin configuration  */
        GPIO_InitStruct.Pin       = FDCAN_2_RX_PIN;
        GPIO_InitStruct.Alternate = FDCAN_2_RX_AF;
        (void)HAL_GPIO_Init(FDCAN_2_RX_GPIO_PORT, &GPIO_InitStruct);
    }
    else
    {
        res = HAL_ERROR;
    }

    return res;
}

HAL_StatusTypeDef FDCAN_Nvic(FDCAN_GlobalTypeDef *fdcan)
{
    HAL_StatusTypeDef res;

    res = HAL_OK;

    if (FDCAN_1 == fdcan)
    {
        HAL_NVIC_SetPriority(FDCAN_1_IRQn, FDCAN_IRQ_PREEMPT_PRIO, 1);
        HAL_NVIC_EnableIRQ(FDCAN_1_IRQn);
#if CAN_STATIC_TX_REPLAY_ENABLE
        HAL_NVIC_SetPriority(
            FDCAN_1_TX_IRQn,
            FDCAN_TX_REPLAY_IRQ_PREEMPT_PRIO,
            1
        );
        HAL_NVIC_EnableIRQ(FDCAN_1_TX_IRQn);
#endif
    }
    else if (FDCAN_2 == fdcan)
    {
        HAL_NVIC_SetPriority(FDCAN_2_IRQn, FDCAN_IRQ_PREEMPT_PRIO, 1);
        HAL_NVIC_EnableIRQ(FDCAN_2_IRQn);
#if CAN_STATIC_TX_REPLAY_ENABLE
        HAL_NVIC_SetPriority(
            FDCAN_2_TX_IRQn,
            FDCAN_TX_REPLAY_IRQ_PREEMPT_PRIO,
            1
        );
        HAL_NVIC_EnableIRQ(FDCAN_2_TX_IRQn);
#endif
    }
    else
    {
        res = HAL_ERROR;
    }

    return res;
}

/**
  * @brief  Initializes the FDCAN MSP.
  * @param  hfdcan: pointer to an FDCAN_HandleTypeDef structure that contains
  *         the configuration information for the specified FDCAN.
  * @retval None
  */
void HAL_FDCAN_MspInit(FDCAN_HandleTypeDef *hfdcan)
{
    RCC_PeriphCLKInitTypeDef RCC_PeriphClkInit;

    /*##-1- Enable peripherals and GPIO Clocks #################################*/
    /* Enable GPIO TX/RX clock */
    (void)FDCAN_GpioClck(hfdcan->Instance);

    /* Select PLL1Q as source of FDCANx clock */
    RCC_PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_FDCAN;
    RCC_PeriphClkInit.FdcanClockSelection  = RCC_FDCANCLKSOURCE_PLL;
    (void)HAL_RCCEx_PeriphCLKConfig(&RCC_PeriphClkInit);

    /* Enable FDCANx clock */
    FDCANx_CLK_ENABLE();

    /*##-2- Configure peripheral GPIO ##########################################*/
    /* FDCANx TX GPIO pin configuration  */
    (void)FDCAN_InitGpio(hfdcan->Instance);

    /*##-3- Configure the NVIC #################################################*/
    /* NVIC for FDCANx */
    (void)FDCAN_Nvic(hfdcan->Instance);
}

/**
  * @brief  DeInitializes the FDCAN MSP.
  * @param  hfdcan: pointer to an FDCAN_HandleTypeDef structure that contains
  *         the configuration information for the specified FDCAN.
  * @retval None
  */
void HAL_FDCAN_MspDeInit(FDCAN_HandleTypeDef *hfdcan)
{
    /*##-1- Reset peripherals ##################################################*/
    FDCANx_FORCE_RESET();
    FDCANx_RELEASE_RESET();

    /*##-2- Disable peripherals and GPIO Clocks ################################*/
    if (FDCAN_1 == hfdcan->Instance)
    {
        /* Configure FDCANx Tx as alternate function  */
        HAL_GPIO_DeInit(FDCAN_1_TX_GPIO_PORT, FDCAN_1_TX_PIN);

        /* Configure FDCANx Rx as alternate function  */
        HAL_GPIO_DeInit(FDCAN_1_RX_GPIO_PORT, FDCAN_1_RX_PIN);

        /*##-3- Disable the NVIC for FDCANx ########################################*/
        HAL_NVIC_DisableIRQ(FDCAN_1_IRQn);
#if CAN_STATIC_TX_REPLAY_ENABLE
        HAL_NVIC_DisableIRQ(FDCAN_1_TX_IRQn);
#endif
    }
    else if (FDCAN_2 == hfdcan->Instance)
    {
        HAL_GPIO_DeInit(FDCAN_2_TX_GPIO_PORT, FDCAN_2_TX_PIN);
        HAL_GPIO_DeInit(FDCAN_2_RX_GPIO_PORT, FDCAN_2_RX_PIN);
        HAL_NVIC_DisableIRQ(FDCAN_2_IRQn);
#if CAN_STATIC_TX_REPLAY_ENABLE
        HAL_NVIC_DisableIRQ(FDCAN_2_TX_IRQn);
#endif
    }
    else
    {
        FDCAN_ErrorHandler();
    }
}

comm_status_t fdcan_init_tx_header(
    const void *pMsg,
    FDCAN_TxHeaderTypeDef *pTxHeader,
    uint32_t frameLength
)
{
    comm_status_t RetVal;
    FDCAN_Message *pMsgCopy;

    RetVal   = COMM_ERROR;
    pMsgCopy = (FDCAN_Message *)pMsg;

    pTxHeader->Identifier = pMsgCopy->can_id;

    if (true == pMsgCopy->isExtendedId)
    {
        pTxHeader->IdType = FDCAN_EXTENDED_ID;
    }
    else
    {
        pTxHeader->IdType = FDCAN_STANDARD_ID;
    }

    pTxHeader->TxFrameType = FDCAN_DATA_FRAME;

    switch (frameLength)
    {
    case 0:
        pTxHeader->DataLength = FDCAN_DLC_BYTES_0;
        break;
    case 1:
        pTxHeader->DataLength = FDCAN_DLC_BYTES_1;
        break;
    case 2:
        pTxHeader->DataLength = FDCAN_DLC_BYTES_2;
        break;
    case 3:
        pTxHeader->DataLength = FDCAN_DLC_BYTES_3;
        break;
    case 4:
        pTxHeader->DataLength = FDCAN_DLC_BYTES_4;
        break;
    case 5:
        pTxHeader->DataLength = FDCAN_DLC_BYTES_5;
        break;
    case 6:
        pTxHeader->DataLength = FDCAN_DLC_BYTES_6;
        break;
    case 7:
        pTxHeader->DataLength = FDCAN_DLC_BYTES_7;
        break;
    case 8:
        pTxHeader->DataLength = FDCAN_DLC_BYTES_8;
        break;
    default:
        break;
    }

    pTxHeader->ErrorStateIndicator = FDCAN_ESI_ACTIVE;
    pTxHeader->BitRateSwitch       = FDCAN_BRS_OFF;
    pTxHeader->FDFormat            = FDCAN_CLASSIC_CAN;
    pTxHeader->TxEventFifoControl  = FDCAN_NO_TX_EVENTS;
    pTxHeader->MessageMarker       = pMsgCopy->msgMarker;

