Clomann/stm32h7-CAN-sniffer/platform/drivers/fdcan/fdcan.c
    RetVal = COMM_SUCCESS;

    return RetVal;
}

comm_status_t ram_usage(FDCAN_GlobalTypeDef *fdcan, uint32_t *size)
{
    comm_status_t res;

    res = COMM_SUCCESS;

    if (FDCAN1 == fdcan)
    {
        *size = 0U * (FDCAN_RAM_RX_SECTION_SIZE);
    }
    else if (FDCAN2 == fdcan)
    {
        *size = 1U * (FDCAN_RAM_RX_SECTION_SIZE);
    }
    else
    {
        res = COMM_ERROR;
    }

    return res;
}

comm_status_t get_fdcan_config(
    FdcanInstanceType *instance,
    FDCAN_FilterTypeDef *pFilterConfig
)
{
    comm_status_t RetVal;
    RetVal = COMM_ERROR;

    /*	Bit time configuration:
        fdcan_ker_ck               = 40 MHz
        Time_quantum (tq)          = 200 ns
        Synchronization_segment    = 1 tq
        Propagation_segment        =  tq
        Phase_segment_1            =  tq
        Phase_segment_2            =  tq
        Synchronization_Jump_width =  tq
        Bit_length                 = 20 tq = 1 �s
        Bit_rate                   = 250 k Bit/s

        sample point at 75 %
    */
    instance->hfdcan.Instance         = instance->fdcan;
    instance->hfdcan.Init.FrameFormat = FDCAN_FRAME_CLASSIC;
#if CAN_STATIC_TX_REPLAY_ENABLE
    instance->hfdcan.Init.Mode = CAN_STATIC_TX_REPLAY_FDCAN_MODE;
#else
    instance->hfdcan.Init.Mode = FDCAN_MODE_DEFAULT;
#endif
    instance->hfdcan.Init.AutoRetransmission = ENABLE;
    instance->hfdcan.Init.TransmitPause      = DISABLE;
    instance->hfdcan.Init.ProtocolException  = ENABLE;
    instance->hfdcan.Init.NominalPrescaler =
        0x4; /* tq = NominalPrescaler x (1/fdcan_ker_ck) */
    instance->hfdcan.Init.NominalSyncJumpWidth = 0x01;
    instance->hfdcan.Init.NominalTimeSeg1 =
        34U; /* NominalTimeSeg1 = Propagation_segment + Phase_segment_1 */
    instance->hfdcan.Init.NominalTimeSeg2 = 5U;
    ram_usage(instance->fdcan, &instance->hfdcan.Init.MessageRAMOffset);
    instance->hfdcan.Init.StdFiltersNbr   = 1;
    instance->hfdcan.Init.ExtFiltersNbr   = 0;
    instance->hfdcan.Init.RxFifo0ElmtsNbr = FDCAN_RAM_RX_ELEMENTS;
    instance->hfdcan.Init.RxFifo0ElmtSize = FDCAN_DATA_BYTES_8;
    instance->hfdcan.Init.RxFifo1ElmtsNbr = 0;
    instance->hfdcan.Init.RxBuffersNbr    = 0;
    instance->hfdcan.Init.TxEventsNbr     = 0;
#if CAN_STATIC_TX_REPLAY_ENABLE
    if (fdcan_static_replay_channel_enabled(instance->fdcan))
    {
        instance->hfdcan.Init.TxBuffersNbr = CAN_STATIC_TX_REPLAY_TX_BUFFERS;
        instance->hfdcan.Init.TxFifoQueueElmtsNbr = 0;
    }
    else
    {
        instance->hfdcan.Init.TxBuffersNbr        = 0;
        instance->hfdcan.Init.TxFifoQueueElmtsNbr = FDCAN_RAM_TX_ELEMENTS;
    }
#else
    instance->hfdcan.Init.TxBuffersNbr        = 0;
    instance->hfdcan.Init.TxFifoQueueElmtsNbr = FDCAN_RAM_TX_ELEMENTS;
#endif
    instance->hfdcan.Init.TxFifoQueueMode = FDCAN_TX_FIFO_OPERATION;
    instance->hfdcan.Init.TxElmtSize      = FDCAN_DATA_BYTES_8;

    pFilterConfig->IdType       = FDCAN_STANDARD_ID;
    pFilterConfig->FilterIndex  = 0;
    pFilterConfig->FilterType   = FDCAN_FILTER_MASK;
    pFilterConfig->FilterConfig = FDCAN_FILTER_TO_RXFIFO0;
    pFilterConfig->FilterID1    = 0x0;
    pFilterConfig->FilterID2    = 0x7FF;

    RetVal = COMM_SUCCESS;

    return RetVal;
}

uint64_t SampleTime(void)
{
    return FDCAN_GetTimestampHook();
}
